# SetReleaseConditions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..SetReleaseConditions Method
AnalyticalMember Class See Also
---
Sets Release Conditions to Analytical Member.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void SetReleaseConditions(
	ReleaseConditions releaseConditions
)
```

Visual Basic
---
```text
Public Sub SetReleaseConditions ( _
	releaseConditions As ReleaseConditions _
)
```

Visual C++
---
```text
public:
void SetReleaseConditions(
	ReleaseConditions^ releaseConditions
)
```

# ### Parameters
releaseConditions
    Type: Autodesk.Revit.DB.Structure..::..ReleaseConditions End to which release conditions will be added is defined by setting [!:Autodesk::Revit::DB::Structure::ReleaseConditions::Position] property in provided release conditions object.
# Remarks
If element already have release conditions defined for that end, newly provided values replace current one. The ReleaseType will be set to UserDefined.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace